src/config/InformationRegisters/Меппинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Меппинг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧемЗаменять</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДанныхМеппинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧтоЗаменять</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/ТипыДанныхМеппинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыДанныхМеппинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/InformationRegisters/Меппинг/Ext/ManagerModule.bsl
Функция ПолучитьЗамену(Организация, ЧтоЗаменять, ТипДанных = Неопределено) Экспорт

	Если ТипДанных = Неопределено Тогда
		ТипДанных = ПредопределенноеЗначение("Перечисление.ТипыДанныхМеппинга.Счет");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Меппинг.ЧемЗаменять КАК ЧемЗаменять
	               |ИЗ
	               |	РегистрСведений.Меппинг КАК Меппинг
	               |ГДЕ
	               |	Меппинг.ТипДанных = &ТипДанных
	               |	И Меппинг.ЧтоЗаменять = &ЧтоЗаменять
	               |	И Меппинг.Организация = &Организация";
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("ЧтоЗаменять", ЧтоЗаменять);
	Запрос.УстановитьПараметр("Организация", Организация);

	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		Возврат ЧтоЗаменять;
	КонецПопытки;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЧтоЗаменять;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ЧемЗаменять;

КонецФункции
